app/controllers/products_controller.rb

	  def admin
	 	@products = Product.all
---
SELECT "products".* FROM "products"