app/views/products/admin.html.erb

SELECT "product_attributes".* FROM "product_attributes"  WHERE "product_attributes"."product_id" = $1  [["product_id", 2]]
SELECT "products".* FROM "products"
---
	<%= p.name %>
	<% p.product_attributes.each do |pa| %>