app/views/products/new.html.erb

				<select type = "text" name = "color[]" class = "form-control" id = "color" multiple>
					<% @attributes['colors'].each do |c| %>
---
SELECT "colors".* FROM "colors"

				<select type = "text" name = "style[]" class = "form-control" id = "style" multiple>
					<% @attributes['styles'].each do |s| %>
---
SELECT "styles".* FROM "styles"

				<select type = "text" name = "size[]" class = "form-control" id = "size" multiple>
					<% @attributes['sizes'].each do |s| %>
---
SELECT "sizes".* FROM "sizes"